tutorial_cases/OF9/FlatPanel_250L_ASU/0.orig/alpha.liquid.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.5;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 0;
        value           uniform 0;
    }
    "wall_.*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
